hboughardain/MEMO-H504/PIC32CM5164LS00/Secure/firmware/src/packs/PIC32CM5164LS00064_DFP/component/evsys.h
#define EVSYS_NONSECUSER0_USER0_Pos           _UINT32_(0)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 0 Position */
#define EVSYS_NONSECUSER0_USER0_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER0_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 0 Mask */
#define EVSYS_NONSECUSER0_USER0(value)        (EVSYS_NONSECUSER0_USER0_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER0_Pos)) /* Assigment of value for USER0 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER1_Pos           _UINT32_(1)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 1 Position */
#define EVSYS_NONSECUSER0_USER1_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER1_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 1 Mask */
#define EVSYS_NONSECUSER0_USER1(value)        (EVSYS_NONSECUSER0_USER1_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER1_Pos)) /* Assigment of value for USER1 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER2_Pos           _UINT32_(2)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 2 Position */
#define EVSYS_NONSECUSER0_USER2_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER2_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 2 Mask */
#define EVSYS_NONSECUSER0_USER2(value)        (EVSYS_NONSECUSER0_USER2_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER2_Pos)) /* Assigment of value for USER2 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER3_Pos           _UINT32_(3)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 3 Position */
#define EVSYS_NONSECUSER0_USER3_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER3_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 3 Mask */
#define EVSYS_NONSECUSER0_USER3(value)        (EVSYS_NONSECUSER0_USER3_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER3_Pos)) /* Assigment of value for USER3 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER4_Pos           _UINT32_(4)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 4 Position */
#define EVSYS_NONSECUSER0_USER4_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER4_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 4 Mask */
#define EVSYS_NONSECUSER0_USER4(value)        (EVSYS_NONSECUSER0_USER4_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER4_Pos)) /* Assigment of value for USER4 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER5_Pos           _UINT32_(5)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 5 Position */
#define EVSYS_NONSECUSER0_USER5_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER5_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 5 Mask */
#define EVSYS_NONSECUSER0_USER5(value)        (EVSYS_NONSECUSER0_USER5_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER5_Pos)) /* Assigment of value for USER5 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER6_Pos           _UINT32_(6)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 6 Position */
#define EVSYS_NONSECUSER0_USER6_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER6_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 6 Mask */
#define EVSYS_NONSECUSER0_USER6(value)        (EVSYS_NONSECUSER0_USER6_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER6_Pos)) /* Assigment of value for USER6 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER7_Pos           _UINT32_(7)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 7 Position */
#define EVSYS_NONSECUSER0_USER7_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER7_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 7 Mask */
#define EVSYS_NONSECUSER0_USER7(value)        (EVSYS_NONSECUSER0_USER7_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER7_Pos)) /* Assigment of value for USER7 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER8_Pos           _UINT32_(8)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 8 Position */
#define EVSYS_NONSECUSER0_USER8_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER8_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 8 Mask */
#define EVSYS_NONSECUSER0_USER8(value)        (EVSYS_NONSECUSER0_USER8_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER8_Pos)) /* Assigment of value for USER8 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER9_Pos           _UINT32_(9)                                          /* (EVSYS_NONSECUSER0) Non-Secure for User 9 Position */
#define EVSYS_NONSECUSER0_USER9_Msk           (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER9_Pos)       /* (EVSYS_NONSECUSER0) Non-Secure for User 9 Mask */
#define EVSYS_NONSECUSER0_USER9(value)        (EVSYS_NONSECUSER0_USER9_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER9_Pos)) /* Assigment of value for USER9 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER10_Pos          _UINT32_(10)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 10 Position */
#define EVSYS_NONSECUSER0_USER10_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER10_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 10 Mask */
#define EVSYS_NONSECUSER0_USER10(value)       (EVSYS_NONSECUSER0_USER10_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER10_Pos)) /* Assigment of value for USER10 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER11_Pos          _UINT32_(11)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 11 Position */
#define EVSYS_NONSECUSER0_USER11_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER11_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 11 Mask */
#define EVSYS_NONSECUSER0_USER11(value)       (EVSYS_NONSECUSER0_USER11_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER11_Pos)) /* Assigment of value for USER11 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER12_Pos          _UINT32_(12)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 12 Position */
#define EVSYS_NONSECUSER0_USER12_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER12_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 12 Mask */
#define EVSYS_NONSECUSER0_USER12(value)       (EVSYS_NONSECUSER0_USER12_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER12_Pos)) /* Assigment of value for USER12 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER13_Pos          _UINT32_(13)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 13 Position */
#define EVSYS_NONSECUSER0_USER13_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER13_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 13 Mask */
#define EVSYS_NONSECUSER0_USER13(value)       (EVSYS_NONSECUSER0_USER13_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER13_Pos)) /* Assigment of value for USER13 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER14_Pos          _UINT32_(14)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 14 Position */
#define EVSYS_NONSECUSER0_USER14_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER14_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 14 Mask */
#define EVSYS_NONSECUSER0_USER14(value)       (EVSYS_NONSECUSER0_USER14_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER14_Pos)) /* Assigment of value for USER14 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER15_Pos          _UINT32_(15)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 15 Position */
#define EVSYS_NONSECUSER0_USER15_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER15_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 15 Mask */
#define EVSYS_NONSECUSER0_USER15(value)       (EVSYS_NONSECUSER0_USER15_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER15_Pos)) /* Assigment of value for USER15 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER16_Pos          _UINT32_(16)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 16 Position */
#define EVSYS_NONSECUSER0_USER16_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER16_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 16 Mask */
#define EVSYS_NONSECUSER0_USER16(value)       (EVSYS_NONSECUSER0_USER16_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER16_Pos)) /* Assigment of value for USER16 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER17_Pos          _UINT32_(17)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 17 Position */
#define EVSYS_NONSECUSER0_USER17_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER17_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 17 Mask */
#define EVSYS_NONSECUSER0_USER17(value)       (EVSYS_NONSECUSER0_USER17_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER17_Pos)) /* Assigment of value for USER17 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER18_Pos          _UINT32_(18)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 18 Position */
#define EVSYS_NONSECUSER0_USER18_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER18_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 18 Mask */
#define EVSYS_NONSECUSER0_USER18(value)       (EVSYS_NONSECUSER0_USER18_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER18_Pos)) /* Assigment of value for USER18 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER19_Pos          _UINT32_(19)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 19 Position */
#define EVSYS_NONSECUSER0_USER19_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER19_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 19 Mask */
#define EVSYS_NONSECUSER0_USER19(value)       (EVSYS_NONSECUSER0_USER19_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER19_Pos)) /* Assigment of value for USER19 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER20_Pos          _UINT32_(20)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 20 Position */
#define EVSYS_NONSECUSER0_USER20_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER20_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 20 Mask */
#define EVSYS_NONSECUSER0_USER20(value)       (EVSYS_NONSECUSER0_USER20_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER20_Pos)) /* Assigment of value for USER20 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER21_Pos          _UINT32_(21)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 21 Position */
#define EVSYS_NONSECUSER0_USER21_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER21_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 21 Mask */
#define EVSYS_NONSECUSER0_USER21(value)       (EVSYS_NONSECUSER0_USER21_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER21_Pos)) /* Assigment of value for USER21 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER22_Pos          _UINT32_(22)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 22 Position */
#define EVSYS_NONSECUSER0_USER22_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER22_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 22 Mask */
#define EVSYS_NONSECUSER0_USER22(value)       (EVSYS_NONSECUSER0_USER22_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER22_Pos)) /* Assigment of value for USER22 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER23_Pos          _UINT32_(23)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 23 Position */
#define EVSYS_NONSECUSER0_USER23_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER23_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 23 Mask */
#define EVSYS_NONSECUSER0_USER23(value)       (EVSYS_NONSECUSER0_USER23_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER23_Pos)) /* Assigment of value for USER23 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER24_Pos          _UINT32_(24)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 24 Position */
#define EVSYS_NONSECUSER0_USER24_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER24_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 24 Mask */
#define EVSYS_NONSECUSER0_USER24(value)       (EVSYS_NONSECUSER0_USER24_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER24_Pos)) /* Assigment of value for USER24 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER25_Pos          _UINT32_(25)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 25 Position */
#define EVSYS_NONSECUSER0_USER25_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER25_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 25 Mask */
#define EVSYS_NONSECUSER0_USER25(value)       (EVSYS_NONSECUSER0_USER25_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER25_Pos)) /* Assigment of value for USER25 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER26_Pos          _UINT32_(26)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 26 Position */
#define EVSYS_NONSECUSER0_USER26_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER26_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 26 Mask */
#define EVSYS_NONSECUSER0_USER26(value)       (EVSYS_NONSECUSER0_USER26_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER26_Pos)) /* Assigment of value for USER26 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER27_Pos          _UINT32_(27)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 27 Position */
#define EVSYS_NONSECUSER0_USER27_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER27_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 27 Mask */
#define EVSYS_NONSECUSER0_USER27(value)       (EVSYS_NONSECUSER0_USER27_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER27_Pos)) /* Assigment of value for USER27 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER28_Pos          _UINT32_(28)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 28 Position */
#define EVSYS_NONSECUSER0_USER28_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER28_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 28 Mask */
#define EVSYS_NONSECUSER0_USER28(value)       (EVSYS_NONSECUSER0_USER28_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER28_Pos)) /* Assigment of value for USER28 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER29_Pos          _UINT32_(29)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 29 Position */
#define EVSYS_NONSECUSER0_USER29_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER29_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 29 Mask */
#define EVSYS_NONSECUSER0_USER29(value)       (EVSYS_NONSECUSER0_USER29_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER29_Pos)) /* Assigment of value for USER29 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER30_Pos          _UINT32_(30)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 30 Position */
#define EVSYS_NONSECUSER0_USER30_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER30_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 30 Mask */
#define EVSYS_NONSECUSER0_USER30(value)       (EVSYS_NONSECUSER0_USER30_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER30_Pos)) /* Assigment of value for USER30 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_USER31_Pos          _UINT32_(31)                                         /* (EVSYS_NONSECUSER0) Non-Secure for User 31 Position */
#define EVSYS_NONSECUSER0_USER31_Msk          (_UINT32_(0x1) << EVSYS_NONSECUSER0_USER31_Pos)      /* (EVSYS_NONSECUSER0) Non-Secure for User 31 Mask */
#define EVSYS_NONSECUSER0_USER31(value)       (EVSYS_NONSECUSER0_USER31_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER31_Pos)) /* Assigment of value for USER31 in the EVSYS_NONSECUSER0 register */
#define EVSYS_NONSECUSER0_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (EVSYS_NONSECUSER0) Register Mask  */

#define EVSYS_NONSECUSER0_USER_Pos            _UINT32_(0)                                          /* (EVSYS_NONSECUSER0 Position) Non-Secure for User 3x */
#define EVSYS_NONSECUSER0_USER_Msk            (_UINT32_(0xFFFFFFFF) << EVSYS_NONSECUSER0_USER_Pos) /* (EVSYS_NONSECUSER0 Mask) USER */
#define EVSYS_NONSECUSER0_USER(value)         (EVSYS_NONSECUSER0_USER_Msk & (_UINT32_(value) << EVSYS_NONSECUSER0_USER_Pos)) 

/* -------- EVSYS_NONSECUSER1 : (EVSYS Offset: 0x1E4) (R/W 32) Users Security Attribution -------- */
#define EVSYS_NONSECUSER1_RESETVALUE          _UINT32_(0x00)                                       /*  (EVSYS_NONSECUSER1) Users Security Attribution  Reset Value */

